UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32_mcus.h
/* Do not edit! Generated automatically from /opt/stm/STM32CubeMX/db/mcu.*/

#if !defined(_STM32_MCUS_H_)
# define _STM32_MCUS_H_

#if defined(MCU_STM32F030x4)
# define DIE 0x444
# include <arch/cm3/stm/generated/stm32f031_pinmux.h>
#elif defined(MCU_STM32F030x6)
# define DIE 0x444
# include <arch/cm3/stm/generated/stm32f031_pinmux.h>
#elif defined(MCU_STM32F030x8)
# define DIE 0x440
# include <arch/cm3/stm/generated/stm32f051_pinmux.h>
#elif defined(MCU_STM32F030xC)
# define DIE 0x442
# include <arch/cm3/stm/generated/stm32f091_pinmux.h>
#elif defined(MCU_STM32F031x4)
# define DIE 0x444
# include <arch/cm3/stm/generated/stm32f031_pinmux.h>
#elif defined(MCU_STM32F031x6)
# define DIE 0x444
# include <arch/cm3/stm/generated/stm32f031_pinmux.h>
#elif defined(MCU_STM32F038x6)
# define DIE 0x444
# include <arch/cm3/stm/generated/stm32f031_pinmux.h>
#elif defined(MCU_STM32F042x4)
# define DIE 0x445
# include <arch/cm3/stm/generated/stm32f042_pinmux.h>
#elif defined(MCU_STM32F042x6)
# define DIE 0x445
# include <arch/cm3/stm/generated/stm32f042_pinmux.h>
#elif defined(MCU_STM32F048x6)
# define DIE 0x445
# include <arch/cm3/stm/generated/stm32f042_pinmux.h>
#elif defined(MCU_STM32F051x4)
# define DIE 0x440
# include <arch/cm3/stm/generated/stm32f051_pinmux.h>
#elif defined(MCU_STM32F051x6)
# define DIE 0x440
# include <arch/cm3/stm/generated/stm32f051_pinmux.h>
#elif defined(MCU_STM32F051x8)
# define DIE 0x440
# include <arch/cm3/stm/generated/stm32f051_pinmux.h>
#elif defined(MCU_STM32F058x8)
# define DIE 0x440
# include <arch/cm3/stm/generated/stm32f051_pinmux.h>
#elif defined(MCU_STM32F070x6)
# define DIE 0x445
# include <arch/cm3/stm/generated/stm32f042_pinmux.h>
#elif defined(MCU_STM32F070xB)
# define DIE 0x448
# include <arch/cm3/stm/generated/stm32f052_pinmux.h>
#elif defined(MCU_STM32F071x8)
# define DIE 0x448
# include <arch/cm3/stm/generated/stm32f052_pinmux.h>
#elif defined(MCU_STM32F071xB)
# define DIE 0x448
# include <arch/cm3/stm/generated/stm32f052_pinmux.h>
#elif defined(MCU_STM32F072x8)
# define DIE 0x448
# include <arch/cm3/stm/generated/stm32f052_pinmux.h>
#elif defined(MCU_STM32F072xB)
# define DIE 0x448
# include <arch/cm3/stm/generated/stm32f052_pinmux.h>
#elif defined(MCU_STM32F078xB)
# define DIE 0x448
# include <arch/cm3/stm/generated/stm32f052_pinmux.h>
#elif defined(MCU_STM32F091xB)
# define DIE 0x442
# include <arch/cm3/stm/generated/stm32f091_pinmux.h>
#elif defined(MCU_STM32F091xC)
# define DIE 0x442
# include <arch/cm3/stm/generated/stm32f091_pinmux.h>
#elif defined(MCU_STM32F098xC)
# define DIE 0x442
# include <arch/cm3/stm/generated/stm32f091_pinmux.h>
#elif defined(MCU_STM32F100x4)
# define DIE 0x420
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F100x6)
# define DIE 0x420
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F100x8)
# define DIE 0x420
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F100xB)
# define DIE 0x420
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F100xC)
# define DIE 0x428
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F100xD)
# define DIE 0x428
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F100xE)
# define DIE 0x428
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F101x4)
# define DIE 0x412
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F101x6)
# define DIE 0x412
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F101x8)
# define DIE 0x410
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F101xB)
# define DIE 0x410
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F101xC)
# define DIE 0x414
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F101xD)
# define DIE 0x414
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F101xE)
# define DIE 0x414
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F101xF)
# define DIE 0x430
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F101xG)
# define DIE 0x430
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F102x4)
# define DIE 0x412
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F102x6)
# define DIE 0x412
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F102x8)
# define DIE 0x410
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F102xB)
# define DIE 0x410
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F103x4)
# define DIE 0x412
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F103x6)
# define DIE 0x412
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F103x8)
# define DIE 0x410
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F103xB)
# define DIE 0x410
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F103xC)
# define DIE 0x414
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F103xD)
# define DIE 0x414
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F103xE)
# define DIE 0x414
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F103xF)
# define DIE 0x430
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F103xG)
# define DIE 0x430
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F105x8)
# define DIE 0x418
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F105xB)
# define DIE 0x418
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F105xC)
# define DIE 0x418
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F107xB)
# define DIE 0x418
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F107xC)
# define DIE 0x418
# include <arch/cm3/stm/stm32f1_pinremap.h>
#elif defined(MCU_STM32F205xB)
# define DIE 0x411
# include <arch/cm3/stm/generated/stm32f217_pinmux.h>
#elif defined(MCU_STM32F205xC)
# define DIE 0x411
# include <arch/cm3/stm/generated/stm32f217_pinmux.h>
#elif defined(MCU_STM32F205xE)
# define DIE 0x411
# include <arch/cm3/stm/generated/stm32f217_pinmux.h>
#elif defined(MCU_STM32F205xF)
# define DIE 0x411
# include <arch/cm3/stm/generated/stm32f217_pinmux.h>
#elif defined(MCU_STM32F205xG)
# define DIE 0x411
# include <arch/cm3/stm/generated/stm32f217_pinmux.h>
#elif defined(MCU_STM32F207xC)
# define DIE 0x411
# include <arch/cm3/stm/generated/stm32f217_pinmux.h>
#elif defined(MCU_STM32F207xE)
# define DIE 0x411
# include <arch/cm3/stm/generated/stm32f217_pinmux.h>
#elif defined(MCU_STM32F207xF)
# define DIE 0x411
# include <arch/cm3/stm/generated/stm32f217_pinmux.h>
#elif defined(MCU_STM32F207xG)
# define DIE 0x411
# include <arch/cm3/stm/generated/stm32f217_pinmux.h>
#elif defined(MCU_STM32F215xE)
# define DIE 0x411
# include <arch/cm3/stm/generated/stm32f217_pinmux.h>
#elif defined(MCU_STM32F215xG)
# define DIE 0x411
# include <arch/cm3/stm/generated/stm32f217_pinmux.h>
#elif defined(MCU_STM32F217xE)
# define DIE 0x411
# include <arch/cm3/stm/generated/stm32f217_pinmux.h>
#elif defined(MCU_STM32F217xG)
# define DIE 0x411
# include <arch/cm3/stm/generated/stm32f217_pinmux.h>
#elif defined(MCU_STM32F301x6)
# define DIE 0x439
# include <arch/cm3/stm/generated/stm32f302_pinmux.h>
#elif defined(MCU_STM32F301x8)
# define DIE 0x439
# include <arch/cm3/stm/generated/stm32f302_pinmux.h>
#elif defined(MCU_STM32F302x6)
# define DIE 0x439
# include <arch/cm3/stm/generated/stm32f302_pinmux.h>
#elif defined(MCU_STM32F302x8)
# define DIE 0x439
# include <arch/cm3/stm/generated/stm32f302_pinmux.h>
#elif defined(MCU_STM32F302xB)
# define DIE 0x422
# include <arch/cm3/stm/generated/stm32f303_pinmux.h>
#elif defined(MCU_STM32F302xC)
# define DIE 0x422
# include <arch/cm3/stm/generated/stm32f303_pinmux.h>
#elif defined(MCU_STM32F302xD)
# define DIE 0x446
# include <arch/cm3/stm/generated/stm32f303e_pinmux.h>
#elif defined(MCU_STM32F302xE)
# define DIE 0x446
# include <arch/cm3/stm/generated/stm32f303e_pinmux.h>
#elif defined(MCU_STM32F303x6)
# define DIE 0x438
# include <arch/cm3/stm/generated/stm32f333_pinmux.h>
#elif defined(MCU_STM32F303x8)
# define DIE 0x438
# include <arch/cm3/stm/generated/stm32f333_pinmux.h>
#elif defined(MCU_STM32F303xB)
# define DIE 0x422
# include <arch/cm3/stm/generated/stm32f303_pinmux.h>
#elif defined(MCU_STM32F303xC)
# define DIE 0x422
# include <arch/cm3/stm/generated/stm32f303_pinmux.h>
#elif defined(MCU_STM32F303xD)
# define DIE 0x446
# include <arch/cm3/stm/generated/stm32f303e_pinmux.h>
#elif defined(MCU_STM32F303xE)
# define DIE 0x446
# include <arch/cm3/stm/generated/stm32f303e_pinmux.h>
#elif defined(MCU_STM32F318x8)
# define DIE 0x439
# include <arch/cm3/stm/generated/stm32f302_pinmux.h>
#elif defined(MCU_STM32F328x8)
# define DIE 0x438
# include <arch/cm3/stm/generated/stm32f333_pinmux.h>
#elif defined(MCU_STM32F334x4)
# define DIE 0x438
# include <arch/cm3/stm/generated/stm32f333_pinmux.h>
#elif defined(MCU_STM32F334x6)
# define DIE 0x438
# include <arch/cm3/stm/generated/stm32f333_pinmux.h>
#elif defined(MCU_STM32F334x8)
# define DIE 0x438
# include <arch/cm3/stm/generated/stm32f333_pinmux.h>
#elif defined(MCU_STM32F358xC)
# define DIE 0x422
# include <arch/cm3/stm/generated/stm32f303_pinmux.h>
#elif defined(MCU_STM32F373x8)
# define DIE 0x432
# include <arch/cm3/stm/generated/stm32f373_pinmux.h>
#elif defined(MCU_STM32F373xB)
# define DIE 0x432
# include <arch/cm3/stm/generated/stm32f373_pinmux.h>
#elif defined(MCU_STM32F373xC)
# define DIE 0x432
# include <arch/cm3/stm/generated/stm32f373_pinmux.h>
#elif defined(MCU_STM32F378xC)
# define DIE 0x432
# include <arch/cm3/stm/generated/stm32f373_pinmux.h>
#elif defined(MCU_STM32F398xE)
# define DIE 0x446
# include <arch/cm3/stm/generated/stm32f303e_pinmux.h>
#elif defined(MCU_STM32F401xB)
# define DIE 0x423
# include <arch/cm3/stm/generated/stm32f401_pinmux.h>
#elif defined(MCU_STM32F401xC)
# define DIE 0x423
# include <arch/cm3/stm/generated/stm32f401_pinmux.h>
#elif defined(MCU_STM32F401xD)
# define DIE 0x433
# include <arch/cm3/stm/generated/stm32f401_pinmux.h>
#elif defined(MCU_STM32F401xE)
# define DIE 0x433
# include <arch/cm3/stm/generated/stm32f401_pinmux.h>
#elif defined(MCU_STM32F405xE)
# define DIE 0x413
# include <arch/cm3/stm/generated/stm32f417_pinmux.h>
#elif defined(MCU_STM32F405xG)
# define DIE 0x413
# include <arch/cm3/stm/generated/stm32f417_pinmux.h>
#elif defined(MCU_STM32F407xE)
# define DIE 0x413
# include <arch/cm3/stm/generated/stm32f417_pinmux.h>
#elif defined(MCU_STM32F407xG)
# define DIE 0x413
# include <arch/cm3/stm/generated/stm32f417_pinmux.h>
#elif defined(MCU_STM32F410x8)
# define DIE 0x458
# include <arch/cm3/stm/generated/stm32f410_pinmux.h>
#elif defined(MCU_STM32F410xB)
# define DIE 0x458
# include <arch/cm3/stm/generated/stm32f410_pinmux.h>
#elif defined(MCU_STM32F411xC)
# define DIE 0x431
# include <arch/cm3/stm/generated/stm32f411_pinmux.h>
#elif defined(MCU_STM32F411xE)
# define DIE 0x431
# include <arch/cm3/stm/generated/stm32f411_pinmux.h>
#elif defined(MCU_STM32F412xE)
# define DIE 0x441
# include <arch/cm3/stm/generated/stm32f412_pinmux.h>
#elif defined(MCU_STM32F412xG)
# define DIE 0x441
# include <arch/cm3/stm/generated/stm32f412_pinmux.h>
#elif defined(MCU_STM32F413xG)
# define DIE 0x463
# include <arch/cm3/stm/generated/stm32f413_pinmux.h>
#elif defined(MCU_STM32F413xH)
# define DIE 0x463
# include <arch/cm3/stm/generated/stm32f413_pinmux.h>
#elif defined(MCU_STM32F415xG)
# define DIE 0x413
# include <arch/cm3/stm/generated/stm32f417_pinmux.h>
#elif defined(MCU_STM32F417xE)
# define DIE 0x413
# include <arch/cm3/stm/generated/stm32f417_pinmux.h>
#elif defined(MCU_STM32F417xG)
# define DIE 0x413
# include <arch/cm3/stm/generated/stm32f417_pinmux.h>
#elif defined(MCU_STM32F423xH)
# define DIE 0x463
# include <arch/cm3/stm/generated/stm32f413_pinmux.h>
#elif defined(MCU_STM32F427xG)
# define DIE 0x419
# include <arch/cm3/stm/generated/stm32f427_pinmux.h>
#elif defined(MCU_STM32F427xI)
# define DIE 0x419
# include <arch/cm3/stm/generated/stm32f427_pinmux.h>
#elif defined(MCU_STM32F429xE)
# define DIE 0x419
# include <arch/cm3/stm/generated/stm32f427_pinmux.h>
#elif defined(MCU_STM32F429xG)
# define DIE 0x419
# include <arch/cm3/stm/generated/stm32f427_pinmux.h>
#elif defined(MCU_STM32F429xI)
# define DIE 0x419
# include <arch/cm3/stm/generated/stm32f427_pinmux.h>
#elif defined(MCU_STM32F437xG)
# define DIE 0x419
# include <arch/cm3/stm/generated/stm32f427_pinmux.h>
#elif defined(MCU_STM32F437xI)
# define DIE 0x419
# include <arch/cm3/stm/generated/stm32f427_pinmux.h>
#elif defined(MCU_STM32F439xG)
# define DIE 0x419
# include <arch/cm3/stm/generated/stm32f427_pinmux.h>
#elif defined(MCU_STM32F439xI)
# define DIE 0x419
# include <arch/cm3/stm/generated/stm32f427_pinmux.h>
#elif defined(MCU_STM32F446xC)
# define DIE 0x421
# include <arch/cm3/stm/generated/stm32f446_pinmux.h>
#elif defined(MCU_STM32F446xE)
# define DIE 0x421
# include <arch/cm3/stm/generated/stm32f446_pinmux.h>
#elif defined(MCU_STM32F469xE)
# define DIE 0x434
# include <arch/cm3/stm/generated/stm32f469_pinmux.h>
#elif defined(MCU_STM32F469xG)
# define DIE 0x434
# include <arch/cm3/stm/generated/stm32f469_pinmux.h>
#elif defined(MCU_STM32F469xI)
# define DIE 0x434
# include <arch/cm3/stm/generated/stm32f469_pinmux.h>
#elif defined(MCU_STM32F479xG)
# define DIE 0x434
# include <arch/cm3/stm/generated/stm32f469_pinmux.h>
#elif defined(MCU_STM32F479xI)
# define DIE 0x434
# include <arch/cm3/stm/generated/stm32f469_pinmux.h>
#elif defined(MCU_STM32F722xC)
# define DIE 0x452
# include <arch/cm3/stm/generated/stm32f72x_pinmux.h>
#elif defined(MCU_STM32F722xE)
# define DIE 0x452
# include <arch/cm3/stm/generated/stm32f72x_pinmux.h>
#elif defined(MCU_STM32F723xC)
# define DIE 0x452
# include <arch/cm3/stm/generated/stm32f72x_pinmux.h>
#elif defined(MCU_STM32F723xE)
# define DIE 0x452
# include <arch/cm3/stm/generated/stm32f72x_pinmux.h>
#elif defined(MCU_STM32F730x8)
# define DIE 0x452
# include <arch/cm3/stm/generated/stm32f72x_pinmux.h>
#elif defined(MCU_STM32F732xE)
# define DIE 0x452
# include <arch/cm3/stm/generated/stm32f72x_pinmux.h>
#elif defined(MCU_STM32F733xE)
# define DIE 0x452
# include <arch/cm3/stm/generated/stm32f72x_pinmux.h>
#elif defined(MCU_STM32F745xE)
# define DIE 0x449
# include <arch/cm3/stm/generated/stm32f746_pinmux.h>
#elif defined(MCU_STM32F745xG)
# define DIE 0x449
# include <arch/cm3/stm/generated/stm32f746_pinmux.h>
#elif defined(MCU_STM32F746xE)
# define DIE 0x449
# include <arch/cm3/stm/generated/stm32f746_pinmux.h>
#elif defined(MCU_STM32F746xG)
# define DIE 0x449
# include <arch/cm3/stm/generated/stm32f746_pinmux.h>
#elif defined(MCU_STM32F750x8)
# define DIE 0x449
# include <arch/cm3/stm/generated/stm32f746_pinmux.h>
#elif defined(MCU_STM32F756xG)
# define DIE 0x449
# include <arch/cm3/stm/generated/stm32f746_pinmux.h>
#elif defined(MCU_STM32F765xG)
# define DIE 0x451
# include <arch/cm3/stm/generated/stm32f76x_pinmux.h>
#elif defined(MCU_STM32F765xI)
# define DIE 0x451
# include <arch/cm3/stm/generated/stm32f76x_pinmux.h>
#elif defined(MCU_STM32F767xG)
# define DIE 0x451
# include <arch/cm3/stm/generated/stm32f76x_pinmux.h>
#elif defined(MCU_STM32F767xI)
# define DIE 0x451
# include <arch/cm3/stm/generated/stm32f76x_pinmux.h>
#elif defined(MCU_STM32F768xI)
# define DIE 0x451
# include <arch/cm3/stm/generated/stm32f76x_pinmux.h>
#elif defined(MCU_STM32F769xG)
# define DIE 0x451
# include <arch/cm3/stm/generated/stm32f76x_pinmux.h>
#elif defined(MCU_STM32F769xI)
# define DIE 0x451
# include <arch/cm3/stm/generated/stm32f76x_pinmux.h>
#elif defined(MCU_STM32F777xI)
# define DIE 0x451
# include <arch/cm3/stm/generated/stm32f76x_pinmux.h>
#elif defined(MCU_STM32F778xI)
# define DIE 0x451
# include <arch/cm3/stm/generated/stm32f76x_pinmux.h>
#elif defined(MCU_STM32F779xI)
# define DIE 0x451
# include <arch/cm3/stm/generated/stm32f76x_pinmux.h>
#elif defined(MCU_STM32G070xB)
# define DIE 0x460
# include <arch/cm3/stm/generated/stm32g07x_pinmux.h>
#elif defined(MCU_STM32G071x6)
# define DIE 0x460
# include <arch/cm3/stm/generated/stm32g07x_pinmux.h>
#elif defined(MCU_STM32G071x8)
# define DIE 0x460
# include <arch/cm3/stm/generated/stm32g07x_pinmux.h>
#elif defined(MCU_STM32G071xB)
# define DIE 0x460
# include <arch/cm3/stm/generated/stm32g07x_pinmux.h>
#elif defined(MCU_STM32G081xB)
# define DIE 0x460
# include <arch/cm3/stm/generated/stm32g07x_pinmux.h>
#elif defined(MCU_STM32H743xG)
# define DIE 0x450
# include <arch/cm3/stm/generated/stm32h747_pinmux.h>
#elif defined(MCU_STM32H743xI)
# define DIE 0x450
# include <arch/cm3/stm/generated/stm32h747_pinmux.h>
#elif defined(MCU_STM32H750xB)
# define DIE 0x450
# include <arch/cm3/stm/generated/stm32h747_pinmux.h>
#elif defined(MCU_STM32H753xG)
# define DIE 0x450
# include <arch/cm3/stm/generated/stm32h747_pinmux.h>
#elif defined(MCU_STM32H753xI)
# define DIE 0x450
# include <arch/cm3/stm/generated/stm32h747_pinmux.h>
#elif defined(MCU_STM32L010x4)
# define DIE 0x457
# include <arch/cm3/stm/generated/stm32l021_pinmux.h>
#elif defined(MCU_STM32L010x6)
# define DIE 0x425
# include <arch/cm3/stm/generated/stm32l031_pinmux.h>
#elif defined(MCU_STM32L010x8)
# define DIE 0x417
# include <arch/cm3/stm/generated/stm32l051_pinmux.h>
#elif defined(MCU_STM32L010xB)
# define DIE 0x447
# include <arch/cm3/stm/generated/stm32l071_pinmux.h>
#elif defined(MCU_STM32L011x3)
# define DIE 0x457
# include <arch/cm3/stm/generated/stm32l021_pinmux.h>
#elif defined(MCU_STM32L011x4)
# define DIE 0x457
# include <arch/cm3/stm/generated/stm32l021_pinmux.h>
#elif defined(MCU_STM32L021x4)
# define DIE 0x457
# include <arch/cm3/stm/generated/stm32l021_pinmux.h>
#elif defined(MCU_STM32L031x4)
# define DIE 0x425
# include <arch/cm3/stm/generated/stm32l031_pinmux.h>
#elif defined(MCU_STM32L031x6)
# define DIE 0x425
# include <arch/cm3/stm/generated/stm32l031_pinmux.h>
#elif defined(MCU_STM32L041x4)
# define DIE 0x425
# include <arch/cm3/stm/generated/stm32l031_pinmux.h>
#elif defined(MCU_STM32L041x6)
# define DIE 0x425
# include <arch/cm3/stm/generated/stm32l031_pinmux.h>
#elif defined(MCU_STM32L051x6)
# define DIE 0x417
# include <arch/cm3/stm/generated/stm32l051_pinmux.h>
#elif defined(MCU_STM32L051x8)
# define DIE 0x417
# include <arch/cm3/stm/generated/stm32l051_pinmux.h>
#elif defined(MCU_STM32L052x6)
# define DIE 0x417
# include <arch/cm3/stm/generated/stm32l051_pinmux.h>
#elif defined(MCU_STM32L052x8)
# define DIE 0x417
# include <arch/cm3/stm/generated/stm32l051_pinmux.h>
#elif defined(MCU_STM32L053x6)
# define DIE 0x417
# include <arch/cm3/stm/generated/stm32l051_pinmux.h>
#elif defined(MCU_STM32L053x8)
# define DIE 0x417
# include <arch/cm3/stm/generated/stm32l051_pinmux.h>
#elif defined(MCU_STM32L062x8)
# define DIE 0x417
# include <arch/cm3/stm/generated/stm32l051_pinmux.h>
#elif defined(MCU_STM32L063x8)
# define DIE 0x417
# include <arch/cm3/stm/generated/stm32l051_pinmux.h>
#elif defined(MCU_STM32L071x8)
# define DIE 0x447
# include <arch/cm3/stm/generated/stm32l071_pinmux.h>
#elif defined(MCU_STM32L071xB)
# define DIE 0x447
# include <arch/cm3/stm/generated/stm32l071_pinmux.h>
#elif defined(MCU_STM32L071xZ)
# define DIE 0x447
# include <arch/cm3/stm/generated/stm32l071_pinmux.h>
#elif defined(MCU_STM32L072x8)
# define DIE 0x447
# include <arch/cm3/stm/generated/stm32l071_pinmux.h>
#elif defined(MCU_STM32L072xB)
# define DIE 0x447
# include <arch/cm3/stm/generated/stm32l071_pinmux.h>
#elif defined(MCU_STM32L072xZ)
# define DIE 0x447
# include <arch/cm3/stm/generated/stm32l071_pinmux.h>
#elif defined(MCU_STM32L073x8)
# define DIE 0x447
# include <arch/cm3/stm/generated/stm32l071_pinmux.h>
#elif defined(MCU_STM32L073xB)
# define DIE 0x447
# include <arch/cm3/stm/generated/stm32l071_pinmux.h>
#elif defined(MCU_STM32L073xZ)
# define DIE 0x447
# include <arch/cm3/stm/generated/stm32l071_pinmux.h>
#elif defined(MCU_STM32L081xB)
# define DIE 0x447
# include <arch/cm3/stm/generated/stm32l071_pinmux.h>
#elif defined(MCU_STM32L081xZ)
# define DIE 0x447
# include <arch/cm3/stm/generated/stm32l071_pinmux.h>
#elif defined(MCU_STM32L082xB)
# define DIE 0x447
# include <arch/cm3/stm/generated/stm32l071_pinmux.h>
#elif defined(MCU_STM32L082xZ)
# define DIE 0x447
# include <arch/cm3/stm/generated/stm32l071_pinmux.h>
#elif defined(MCU_STM32L083x8)
# define DIE 0x447
# include <arch/cm3/stm/generated/stm32l071_pinmux.h>
#elif defined(MCU_STM32L083xB)
# define DIE 0x447
# include <arch/cm3/stm/generated/stm32l071_pinmux.h>
#elif defined(MCU_STM32L083xZ)
# define DIE 0x447
# include <arch/cm3/stm/generated/stm32l071_pinmux.h>
#elif defined(MCU_STM32L100x6)
# define DIE 0x416
# include <arch/cm3/stm/generated/stm32l152x8_pinmux.h>
#elif defined(MCU_STM32L100x6A)
# define DIE 0x429
# include <arch/cm3/stm/generated/stm32l15xxa_pinmux.h>
#elif defined(MCU_STM32L100x8)
# define DIE 0x416
# include <arch/cm3/stm/generated/stm32l152x8_pinmux.h>
#elif defined(MCU_STM32L100x8A)
# define DIE 0x429
# include <arch/cm3/stm/generated/stm32l15xxa_pinmux.h>
#elif defined(MCU_STM32L100xB)
# define DIE 0x416
# include <arch/cm3/stm/generated/stm32l152x8_pinmux.h>
#elif defined(MCU_STM32L100xBA)
# define DIE 0x429
# include <arch/cm3/stm/generated/stm32l15xxa_pinmux.h>
#elif defined(MCU_STM32L100xC)
# define DIE 0x427
# include <arch/cm3/stm/generated/stm32l152xc_pinmux.h>
#elif defined(MCU_STM32L151x6)
# define DIE 0x416
# include <arch/cm3/stm/generated/stm32l152x8_pinmux.h>
#elif defined(MCU_STM32L151x6A)
# define DIE 0x429
# include <arch/cm3/stm/generated/stm32l15xxa_pinmux.h>
#elif defined(MCU_STM32L151x8)
# define DIE 0x416
# include <arch/cm3/stm/generated/stm32l152x8_pinmux.h>
#elif defined(MCU_STM32L151x8A)
# define DIE 0x429
# include <arch/cm3/stm/generated/stm32l15xxa_pinmux.h>
#elif defined(MCU_STM32L151xB)
# define DIE 0x416
# include <arch/cm3/stm/generated/stm32l152x8_pinmux.h>
#elif defined(MCU_STM32L151xBA)
# define DIE 0x429
# include <arch/cm3/stm/generated/stm32l15xxa_pinmux.h>
#elif defined(MCU_STM32L151xC)
# define DIE 0x427
# include <arch/cm3/stm/generated/stm32l152xc_pinmux.h>
#elif defined(MCU_STM32L151xCA)
# define DIE 0x436
# include <arch/cm3/stm/generated/stm32l162xd_pinmux.h>
#elif defined(MCU_STM32L151xD)
# define DIE 0x436
# include <arch/cm3/stm/generated/stm32l162xd_pinmux.h>
#elif defined(MCU_STM32L151xE)
# define DIE 0x437
# include <arch/cm3/stm/generated/stm32l162xe_pinmux.h>
#elif defined(MCU_STM32L152x6)
# define DIE 0x416
# include <arch/cm3/stm/generated/stm32l152x8_pinmux.h>
#elif defined(MCU_STM32L152x6A)
# define DIE 0x429
# include <arch/cm3/stm/generated/stm32l15xxa_pinmux.h>
#elif defined(MCU_STM32L152x8)
# define DIE 0x416
# include <arch/cm3/stm/generated/stm32l152x8_pinmux.h>
#elif defined(MCU_STM32L152x8A)
# define DIE 0x429
# include <arch/cm3/stm/generated/stm32l15xxa_pinmux.h>
#elif defined(MCU_STM32L152xB)
# define DIE 0x416
# include <arch/cm3/stm/generated/stm32l152x8_pinmux.h>
#elif defined(MCU_STM32L152xBA)
# define DIE 0x429
# include <arch/cm3/stm/generated/stm32l15xxa_pinmux.h>
#elif defined(MCU_STM32L152xC)
# define DIE 0x427
# include <arch/cm3/stm/generated/stm32l152xc_pinmux.h>
#elif defined(MCU_STM32L152xCA)
# define DIE 0x436
# include <arch/cm3/stm/generated/stm32l162xd_pinmux.h>
#elif defined(MCU_STM32L152xD)
# define DIE 0x436
# include <arch/cm3/stm/generated/stm32l162xd_pinmux.h>
#elif defined(MCU_STM32L152xE)
# define DIE 0x437
# include <arch/cm3/stm/generated/stm32l162xe_pinmux.h>
#elif defined(MCU_STM32L162xC)
# define DIE 0x427
# include <arch/cm3/stm/generated/stm32l152xc_pinmux.h>
#elif defined(MCU_STM32L162xCA)
# define DIE 0x436
# include <arch/cm3/stm/generated/stm32l162xd_pinmux.h>
#elif defined(MCU_STM32L162xD)
# define DIE 0x436
# include <arch/cm3/stm/generated/stm32l162xd_pinmux.h>
#elif defined(MCU_STM32L162xE)
# define DIE 0x437
# include <arch/cm3/stm/generated/stm32l162xe_pinmux.h>
#elif defined(MCU_STM32L412x8)
# define DIE 0x464
# include <arch/cm3/stm/generated/stm32l41x_pinmux.h>
