UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32_mcus.h
#elif defined(MCU_STM32L412xB)
# define DIE 0x464
# include <arch/cm3/stm/generated/stm32l41x_pinmux.h>
#elif defined(MCU_STM32L422xB)
# define DIE 0x464
# include <arch/cm3/stm/generated/stm32l41x_pinmux.h>
#elif defined(MCU_STM32L431xB)
# define DIE 0x435
# include <arch/cm3/stm/generated/stm32l43x_pinmux.h>
#elif defined(MCU_STM32L431xC)
# define DIE 0x435
# include <arch/cm3/stm/generated/stm32l43x_pinmux.h>
#elif defined(MCU_STM32L432xB)
# define DIE 0x435
# include <arch/cm3/stm/generated/stm32l43x_pinmux.h>
#elif defined(MCU_STM32L432xC)
# define DIE 0x435
# include <arch/cm3/stm/generated/stm32l43x_pinmux.h>
#elif defined(MCU_STM32L433xB)
# define DIE 0x435
# include <arch/cm3/stm/generated/stm32l43x_pinmux.h>
#elif defined(MCU_STM32L433xC)
# define DIE 0x435
# include <arch/cm3/stm/generated/stm32l43x_pinmux.h>
#elif defined(MCU_STM32L442xC)
# define DIE 0x435
# include <arch/cm3/stm/generated/stm32l43x_pinmux.h>
#elif defined(MCU_STM32L443xC)
# define DIE 0x435
# include <arch/cm3/stm/generated/stm32l43x_pinmux.h>
#elif defined(MCU_STM32L451xC)
# define DIE 0x462
# include <arch/cm3/stm/generated/stm32l45x_pinmux.h>
#elif defined(MCU_STM32L451xE)
# define DIE 0x462
# include <arch/cm3/stm/generated/stm32l45x_pinmux.h>
#elif defined(MCU_STM32L452xC)
# define DIE 0x462
# include <arch/cm3/stm/generated/stm32l45x_pinmux.h>
#elif defined(MCU_STM32L452xE)
# define DIE 0x462
# include <arch/cm3/stm/generated/stm32l45x_pinmux.h>
#elif defined(MCU_STM32L462xE)
# define DIE 0x462
# include <arch/cm3/stm/generated/stm32l45x_pinmux.h>
#elif defined(MCU_STM32L471xE)
# define DIE 0x415
# include <arch/cm3/stm/generated/stm32l47x_pinmux.h>
#elif defined(MCU_STM32L471xG)
# define DIE 0x415
# include <arch/cm3/stm/generated/stm32l47x_pinmux.h>
#elif defined(MCU_STM32L475xC)
# define DIE 0x415
# include <arch/cm3/stm/generated/stm32l47x_pinmux.h>
#elif defined(MCU_STM32L475xE)
# define DIE 0x415
# include <arch/cm3/stm/generated/stm32l47x_pinmux.h>
#elif defined(MCU_STM32L475xG)
# define DIE 0x415
# include <arch/cm3/stm/generated/stm32l47x_pinmux.h>
#elif defined(MCU_STM32L476xC)
# define DIE 0x415
# include <arch/cm3/stm/generated/stm32l47x_pinmux.h>
#elif defined(MCU_STM32L476xE)
# define DIE 0x415
# include <arch/cm3/stm/generated/stm32l47x_pinmux.h>
#elif defined(MCU_STM32L476xG)
# define DIE 0x415
# include <arch/cm3/stm/generated/stm32l47x_pinmux.h>
#elif defined(MCU_STM32L485xC)
# define DIE 0x415
# include <arch/cm3/stm/generated/stm32l47x_pinmux.h>
#elif defined(MCU_STM32L485xE)
# define DIE 0x415
# include <arch/cm3/stm/generated/stm32l47x_pinmux.h>
#elif defined(MCU_STM32L486xG)
# define DIE 0x415
# include <arch/cm3/stm/generated/stm32l47x_pinmux.h>
#elif defined(MCU_STM32L496xE)
# define DIE 0x461
# include <arch/cm3/stm/generated/stm32l49x_pinmux.h>
#elif defined(MCU_STM32L496xG)
# define DIE 0x461
# include <arch/cm3/stm/generated/stm32l49x_pinmux.h>
#elif defined(MCU_STM32L4A6xG)
# define DIE 0x461
# include <arch/cm3/stm/generated/stm32l49x_pinmux.h>
#elif defined(MCU_STM32L4R5xG)
# define DIE 0x470
# include <arch/cm3/stm/generated/stm32l4rx_pinmux.h>
#elif defined(MCU_STM32L4R5xI)
# define DIE 0x470
# include <arch/cm3/stm/generated/stm32l4rx_pinmux.h>
#elif defined(MCU_STM32L4R7xI)
# define DIE 0x470
# include <arch/cm3/stm/generated/stm32l4rx_pinmux.h>
#elif defined(MCU_STM32L4R9xG)
# define DIE 0x470
# include <arch/cm3/stm/generated/stm32l4rx_pinmux.h>
#elif defined(MCU_STM32L4R9xI)
# define DIE 0x470
# include <arch/cm3/stm/generated/stm32l4rx_pinmux.h>
#elif defined(MCU_STM32L4S5xI)
# define DIE 0x470
# include <arch/cm3/stm/generated/stm32l4rx_pinmux.h>
#elif defined(MCU_STM32L4S7xI)
# define DIE 0x470
# include <arch/cm3/stm/generated/stm32l4rx_pinmux.h>
#elif defined(MCU_STM32L4S9xI)
# define DIE 0x470
# include <arch/cm3/stm/generated/stm32l4rx_pinmux.h>
#endif

#endif
